dresden-elektronik/openthread-r21/src/HAL/samr21Trx.c
/*
 * Copyright (c) 2023 dresden elektronik ingenieurtechnik gmbh.
 * All rights reserved.
 *
 * The software in this package is published under the terms of the BSD
 * style license a copy of which has been included with this distribution in
 * the LICENSE.txt file.
 *
 */
#include "samr21Trx.h"

static struct trxVars_s
{
    DmacDescriptor txDmacDescriptor;
    DmacDescriptor txDmacDescriptorWB;

    volatile bool spiActive;
    volatile bool dmaActive;
}s_trxVars =
{
    .spiActive = false,

    .txDmacDescriptor.BTCTRL.bit.VALID = 0,
    .txDmacDescriptor.BTCTRL.bit.EVOSEL = DMAC_BTCTRL_EVOSEL_DISABLE_Val,
    .txDmacDescriptor.BTCTRL.bit.BLOCKACT = DMAC_BTCTRL_BLOCKACT_BOTH_Val,
    .txDmacDescriptor.BTCTRL.bit.BEATSIZE = DMAC_BTCTRL_BEATSIZE_BYTE_Val,
    .txDmacDescriptor.BTCTRL.bit.SRCINC = 1,
    .txDmacDescriptor.BTCTRL.bit.DSTINC = 0,
    .txDmacDescriptor.BTCTRL.bit.STEPSEL = DMAC_BTCTRL_STEPSEL_SRC_Val,
    .txDmacDescriptor.BTCTRL.bit.STEPSIZE =DMAC_BTCTRL_STEPSIZE_X1_Val ,

    .txDmacDescriptor.DSTADDR.bit.DSTADDR = &SERCOM4->SPI.DATA,
    .txDmacDescriptor.DESCADDR.bit.DESCADDR= 0x00000000 
};


static ramCopyTrxRegister_t s_ramCopyTrxRegister = 
{
    // Default Config
    .trxCtrl1.bit.irqPolarity = 0,
    .trxCtrl1.bit.irqMaskMode = 0,
    .trxCtrl1.bit.spiCmdMode = 0x1,
    .trxCtrl1.bit.rxBlCtrl = 1,
    .trxCtrl1.bit.txAutoCrcOn = 1,
    .trxCtrl1.bit.irq2ExtEn = 0,

#ifdef _GCF_RELEASE_
    .trxCtrl1.bit.paExtnEn = 1,
    .phyTxPwr.bit.txPwr = 0x7
#else
    .trxCtrl1.bit.paExtnEn = 0,
    .phyTxPwr.bit.txPwr = 0x0
#endif
};

void samr21TrxInterfaceInit()
{
    // Setup Clocks for TRX-SPI Sercom
    // Use GCLKGEN1 as core Clock for SPI At86rf233 (SERCOM4, Synchronous)
    GCLK->CLKCTRL.reg =
        // GCLK_CLKCTRL_WRTLOCK
        GCLK_CLKCTRL_CLKEN | GCLK_CLKCTRL_GEN(1) // GCLKGEN1 (Sourced from At86rf233 mClk)
        | GCLK_CLKCTRL_ID(GCLK_CLKCTRL_ID_SERCOM4_CORE_Val);

    // Wait for synchronization
    while (GCLK->STATUS.reg & GCLK_STATUS_SYNCBUSY)
        ;

    GCLK->CLKCTRL.reg =
        // GCLK_CLKCTRL_WRTLOCK
        GCLK_CLKCTRL_CLKEN | GCLK_CLKCTRL_GEN(1) // GCLKGEN1
        | GCLK_CLKCTRL_ID(GCLK_CLKCTRL_ID_SERCOMX_SLOW_Val);

    // Wait for synchronization
    while (GCLK->STATUS.reg & GCLK_STATUS_SYNCBUSY)
        ;
    
    // Enable Sercom  in Power manager
    PM->APBCMASK.bit.SERCOM4_ = 1;

    // Setup Ports for TRX
    // Setup PIN PC19 as MISO <-> At86rf233 via SERCOM4
    // Make Input
    PORT->Group[2].DIRCLR.reg = PORT_PC19;

    // Setup Mux Settings
    PORT->Group[2].WRCONFIG.reg =
        PORT_WRCONFIG_HWSEL | PORT_WRCONFIG_WRPINCFG | PORT_WRCONFIG_WRPMUX | PORT_WRCONFIG_PMUX(MUX_PC19F_SERCOM4_PAD0)
        //|PORT_WRCONFIG_PULLEN
        | PORT_WRCONFIG_INEN | PORT_WRCONFIG_PMUXEN | PORT_WRCONFIG_PINMASK(PORT_PC19 >> 16) // upper Halfword
        ;

    // Setup PIN PB30 as MOSI <-> At86rf233 via SERCOM4
    // Make Output
    PORT->Group[1].DIRSET.reg = PORT_PB30;

    // Setup Mux Settings
    PORT->Group[1].WRCONFIG.reg =
        PORT_WRCONFIG_HWSEL | PORT_WRCONFIG_WRPINCFG | PORT_WRCONFIG_WRPMUX | PORT_WRCONFIG_PMUX(MUX_PB30F_SERCOM4_PAD2)
        //|PORT_WRCONFIG_PULLEN
        //|PORT_WRCONFIG_INEN
        | PORT_WRCONFIG_PMUXEN | PORT_WRCONFIG_PINMASK(PORT_PB30 >> 16) // upper Halfword
        ;

    // Setup PIN PC18 as SCLK <-> At86rf233 via SERCOM4
    // Make Output
    PORT->Group[2].DIRSET.reg = PORT_PC18;

    // Setup Mux Settings
    PORT->Group[2].WRCONFIG.reg =
        PORT_WRCONFIG_HWSEL | PORT_WRCONFIG_WRPINCFG | PORT_WRCONFIG_WRPMUX | PORT_WRCONFIG_PMUX(MUX_PC18F_SERCOM4_PAD3)
        //|PORT_WRCONFIG_PULLEN
        //|PORT_WRCONFIG_INEN
        | PORT_WRCONFIG_PMUXEN | PORT_WRCONFIG_PINMASK(PORT_PC18 >> 16) // upper Halfword
        ;

    // Setup PIN PB31 as SEL <-> At86rf233
    // SEL is configreud as Mnual PORT, cause we need Control over ist for
    // Realtime Buffer Read
    // Make Output
    PORT->Group[1].DIRSET.reg = PORT_PB31;

    // Setup Mux Settings
    PORT->Group[1].WRCONFIG.reg =
        PORT_WRCONFIG_HWSEL | PORT_WRCONFIG_WRPINCFG
        //|PORT_WRCONFIG_WRPMUX
        //|PORT_WRCONFIG_PMUX(0)
        //|PORT_WRCONFIG_PULLEN
        //|PORT_WRCONFIG_INEN
        //|PORT_WRCONFIG_PMUXEN
        | PORT_WRCONFIG_PINMASK(PORT_PB31 >> 16) // upper Halfword
        ;

    // Set Default High
    PORT->Group[1].OUT.reg |= ((uint32_t)1 & 0x1) << 31;

    // Setup PIN PB15 as RSTN <-> At86rf233
    // Make Output
    PORT->Group[1].DIRSET.reg = PORT_PB15;

    // Setup Mux Settings
    PORT->Group[1].WRCONFIG.reg =
        // PORT_WRCONFIG_HWSEL
        PORT_WRCONFIG_WRPINCFG
        //|PORT_WRCONFIG_WRPMUX
        //|PORT_WRCONFIG_PMUX(0)
        //|PORT_WRCONFIG_PULLEN
        //|PORT_WRCONFIG_INEN
        //|PORT_WRCONFIG_PMUXEN
        | PORT_WRCONFIG_PINMASK(PORT_PB15) // lower Halfword
        ;

    // Set Default High
    PORT->Group[1].OUT.reg |= ((uint32_t)1 & 0x1) << 15;
    // Setup PIN PB00 as IRQ <-> At86rf233 via EXTINT[0]
    // Make Input
    PORT->Group[1].DIRCLR.reg = PORT_PB00;

    // Setup Mux Settings
    PORT->Group[1].WRCONFIG.reg =
        // PORT_WRCONFIG_HWSEL
        PORT_WRCONFIG_WRPINCFG | PORT_WRCONFIG_WRPMUX | PORT_WRCONFIG_PMUX(MUX_PB00A_EIC_EXTINT0)
        //|PORT_WRCONFIG_PULLEN
        | PORT_WRCONFIG_INEN | PORT_WRCONFIG_PMUXEN | PORT_WRCONFIG_PINMASK(PORT_PB00) // lower Halfword
        ;
    // Setup PIN PA20 as SLP_TR <-> At86rf233
    // Make Output
    PORT->Group[0].DIRSET.reg = PORT_PA20;

    // Setup Mux Settings
    PORT->Group[0].WRCONFIG.reg =
        PORT_WRCONFIG_HWSEL | PORT_WRCONFIG_WRPINCFG
        //|PORT_WRCONFIG_WRPMUX
        //|PORT_WRCONFIG_PMUX(0)
        //|PORT_WRCONFIG_PULLEN
        //|PORT_WRCONFIG_INEN
        //|PORT_WRCONFIG_PMUXEN
        | PORT_WRCONFIG_PINMASK(PORT_PA20 >> 16) // upper Halfword
        ;

    // Set Default Low
    PORT->Group[0].OUT.reg |= ((uint32_t)0 & 0x1) << 20;

    // Reset SERCOM4
    SERCOM4->SPI.CTRLA.bit.SWRST = 1;

