dresden-elektronik/openthread-r21/src/HAL/samr21Trx.c
    // Wait for SERCOM4 reset to finish
    while (SERCOM4->SPI.CTRLA.bit.SWRST || SERCOM4->SPI.SYNCBUSY.bit.SWRST)
        ;

    // Setup SERCOM4

    // F_ref = 16MHz (if At86r233 ist setup correctly) F_baud = F_ref / 2*(BAUD+1) ---> BAUD = 0 F_baud = 8Mhz
    SERCOM4->SPI.BAUD.reg =
        SERCOM_SPI_BAUD_BAUD(0x0);

    SERCOM4->SPI.CTRLB.reg =
        SERCOM_SPI_CTRLB_RXEN
        //|SERCOM_SPI_CTRLB_AMODE(0)
        //|SERCOM_SPI_CTRLB_MSSEN
        //|SERCOM_SPI_CTRLB_SSDE
        //|SERCOM_SPI_CTRLB_PLOADEN
        | SERCOM_SPI_CTRLB_CHSIZE(0x0) // 8Bit
        ;
    // Wait for SERCOM4 Sync
    while (SERCOM4->SPI.SYNCBUSY.bit.CTRLB)
        ;

    SERCOM4->SPI.CTRLA.reg =
        SERCOM_SPI_CTRLA_RUNSTDBY | SERCOM_SPI_CTRLA_MODE(SERCOM_SPI_CTRLA_MODE_SPI_MASTER_Val) | SERCOM_SPI_CTRLA_ENABLE
        //|SERCOM_SPI_CTRLA_SWRST
        //|SERCOM_SPI_CTRLA_IBON
        | SERCOM_SPI_CTRLA_DOPO(1) // MOSI IS ON PB30 SERCOM4/PAD[2] , SCLK ON PB30 SERCOM4/PAD[3]
        | SERCOM_SPI_CTRLA_DIPO(0) // MISO IS ON PC19 SERCOM4/PAD[0]
        | SERCOM_SPI_CTRLA_FORM(0)
        //|SERCOM_SPI_CTRLA_CPHA
        //|SERCOM_SPI_CTRLA_CPOL
        //|SERCOM_SPI_CTRLA_DORD
        ;
    // Wait for SERCOM4 to setup
    while (SERCOM4->SPI.SYNCBUSY.reg)
        ;

    // Write predefined Operating-Values to Config Registers of the AT86rf233
    samr21TrxWriteRegister(TRX_CTRL_1_REG_ADDR, s_ramCopyTrxRegister.trxCtrl1.reg);
    samr21TrxWriteRegister(PHY_TX_PWR_REG_ADDR, s_ramCopyTrxRegister.phyTxPwr.reg);

    // Enable Timer 5 for Trx Orchestration
    samr21Timer5Init(0,true,true); // 1MHz / (2^0) -> 1us resolution 
    
    // Enable Timer 3 for DMA Paceing
    samr21Timer3Init(0,false,true); // 1MHz / (2^0) -> 1us resolution




    //Enable DMA in Power Manager for Framebuffer Upload purposes
    PM->APBBMASK.bit.DMAC_ =1;
    PM->AHBMASK.bit.DMAC_ = 1;

    //Disable DMA (and the adjacent CRC-Module) at first
    DMAC->CTRL.bit.DMAENABLE = 0;
    DMAC->CTRL.bit.CRCENABLE = 0;

    //Wait till both are disabled
    while (DMAC->CTRL.bit.DMAENABLE || DMAC->CTRL.bit.CRCENABLE );

    //Reset DMA Module 
    DMAC->CTRL.bit.SWRST = 1;

    //Wait for reset to finish
    while (DMAC->CTRL.bit.SWRST );

    //Set relevant DMAC DIscriptor Adresses
    DMAC->BASEADDR.reg= &s_trxVars.txDmacDescriptor;
    DMAC->WRBADDR.reg= &s_trxVars.txDmacDescriptorWB;

    //Enable the DMAC Module and Prio-Level 0  (Noy really needed cause there is only one active DMA)
   DMAC->CTRL.reg =
        DMAC_CTRL_DMAENABLE,
        DMAC_CTRL_LVLEN0
    ;

    //Select Channel 0 for configuration
    DMAC->CHID.bit.ID = 0x0;

    //Setup channel 0 for Transmission of 1 Byte till Sercom is ready for the next byte
    DMAC->CHCTRLB.reg = 
        DMAC_CHCTRLB_CMD_NOACT
        | DMAC_CHCTRLB_TRIGACT_BEAT
        | DMAC_CHCTRLB_TRIGSRC(0x18)     //Sercom4 TX Complete
        | DMAC_CHCTRLB_LVL_LVL0                 //Set Prio-Level 0  (Not really needed cause there is only one DMA-Action going on at a time)
        //| DMAC_CHCTRLB_EVOE                   //Event Generation is disabled
        //| DMAC_CHCTRLB_EVIE                     //Event Input is disabled
        | DMAC_CHCTRLB_EVACT_NOACT      //Not Action defined for an input Event
    ;

    DMAC->CHINTENSET.reg=
        DMAC_CHINTENSET_TERR
        | DMAC_CHINTENSET_TCMPL
    ;

    //TODO Remove in Release
    DMAC->DBGRUN.reg= 1;

    NVIC_EnableIRQ(DMAC_IRQn);
}

void samr21TrxInterruptInit()
{

    // Get TRX into IDLE (STATUS_TRX_OFF) State
    samr21TrxForceMoveToIdle(true);

    // Enable EIC in Power Manager
    PM->APBAMASK.bit.EIC_ = 1;

    // Enable IRQ via EIC
    // Use GCLKGEN0 as core Clock for EIC (At86rf233, IRQ_Detect)
    GCLK->CLKCTRL.reg =
        // GCLK_CLKCTRL_WRTLOCK
        GCLK_CLKCTRL_CLKEN | GCLK_CLKCTRL_GEN(0) // GCLKGEN1
        | GCLK_CLKCTRL_ID(GCLK_CLKCTRL_ID_EIC_Val);
    // Wait for synchronization
    while (GCLK->STATUS.reg & GCLK_STATUS_SYNCBUSY)
        ;
    // Reset first and wait for reset to finish
    EIC->CTRL.bit.SWRST = 1;
    while (EIC->STATUS.bit.SYNCBUSY)
        ;
    while (EIC->CTRL.bit.SWRST)
        ;

    // Enable EXINT[0]
    EIC->CONFIG[0].bit.FILTEN0 = 0;
    EIC->CONFIG[0].bit.SENSE0 = EIC_CONFIG_SENSE0_RISE_Val;
    EIC->INTENSET.bit.EXTINT0 = 1;

    // Enable Module
    EIC->CTRL.bit.ENABLE = 1;
    while (EIC->STATUS.bit.SYNCBUSY)
        ;
    while (!(EIC->CTRL.bit.ENABLE))
        ;

    // Read Once to clear all pending Interrupts
    samr21TrxReadRegister(IRQ_STATUS_REG_ADDR);

    // Clear Irqflag once before returning
    EIC->INTFLAG.bit.EXTINT0 = 1;
}

void samr21TrxInterruptDeinit()
{

    if (EIC->CTRL.bit.ENABLE)
    {
        // Disable EIC Module
        EIC->CTRL.bit.ENABLE = 0;
        while ((EIC->CTRL.bit.ENABLE))
            ;

        // Reset after
        EIC->CTRL.bit.SWRST = 1;
        while (EIC->STATUS.bit.SYNCBUSY)
            ;
        while (EIC->CTRL.bit.SWRST)
            ;

        // Disable GCLKGEN0 for EIC (At86rf233, IRQ_Detect)
        GCLK->CLKCTRL.reg =
            // GCLK_CLKCTRL_WRTLOCK
            GCLK_CLKCTRL_CLKEN | GCLK_CLKCTRL_GEN(0) // GCLKGEN1
            | GCLK_CLKCTRL_ID(GCLK_CLKCTRL_ID_EIC_Val);

        // Wait for synchronization
        while (GCLK->STATUS.reg & GCLK_STATUS_SYNCBUSY)
            ;
    }

    // Disable EIC in Power Manager
    if (PM->APBAMASK.bit.EIC_)
    {
        PM->APBAMASK.bit.EIC_ = 0;
    }

}

void samr21TrxSetupMClk(uint8_t a_clk)
{

    // Write desired Value into the CLKM Register (0x05 -> 16Mhz)
    s_ramCopyTrxRegister.trxCtrl0.bit.clkmCtrl = a_clk;

    samr21TrxWriteRegister(TRX_CTRL_0_REG_ADDR, s_ramCopyTrxRegister.trxCtrl0.reg);

    // Wait a bit for the  the Freq.-change to take place
    samr21delaySysTick(50);
}

uint8_t samr21TrxReadRegister(uint8_t a_addr)
{

    samr21TrxSpiStartAccess(AT86RF233_CMD_REG_READ_MASK, a_addr);

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif

    uint8_t rVal = samr21TrxSpiReadByteRaw();

    samr21TrxSpiCloseAccess();

