dresden-elektronik/openthread-r21/src/HAL/samr21Trx.c
    return rVal;
}

void samr21TrxWriteRegister(uint8_t a_addr, uint8_t a_data)
{

    samr21TrxSpiStartAccess(AT86RF233_CMD_REG_WRITE_MASK, a_addr);

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif

    samr21TrxSpiTransceiveByteRaw(a_data);

    samr21TrxSpiCloseAccess();
}

void samr21TrxSpiStartAccess(uint8_t a_command, uint8_t a_addr)
{
    // Wait for other ongoing SPI Access to End
    while (s_trxVars.spiActive)
        ;

    NVIC_DisableIRQ(EIC_IRQn);

    s_trxVars.spiActive = true;
    PORT->Group[1].OUTCLR.reg = 1 << 31; // SSel Low Active

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_AFTER_SSEL_LOW);
#endif

    // Register Read/Write
    if (a_command & AT86RF233_CMD_REG_READ_MASK)
    {
        s_ramCopyTrxRegister.trxStatus.reg = samr21TrxSpiTransceiveByteRaw((a_addr & 0x3F) | a_command);
        return;
    }

    // Framebuffer Access
    if (a_command & AT86RF233_CMD_FRAMEBUFFER_READ)
    {
        s_ramCopyTrxRegister.trxStatus.reg = samr21TrxSpiTransceiveByteRaw(a_command);
        return;
    }

    // SRAM Access
    s_ramCopyTrxRegister.trxStatus.reg = samr21TrxSpiTransceiveByteRaw(a_command);

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    samr21TrxSpiTransceiveByteRaw(a_addr);
}

void samr21TrxSpiCloseAccess()
{
    PORT->Group[1].OUTSET.reg = 1 << 31; // SSel Low Active

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_AFTER_SSEL_LOW);
#endif
    s_trxVars.spiActive = false;

    NVIC_EnableIRQ(EIC_IRQn);
    // NVIC_EnableIRQ(TC4_IRQn);
}

void samr21TrxUpdateStatusRegister()
{

    while (s_trxVars.spiActive)
        ;
    __disable_irq();
    PORT->Group[1].OUTCLR.reg = 1 << 31; // SSel Low Active
    s_trxVars.spiActive  = true;

    s_ramCopyTrxRegister.trxStatus.reg = samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);

    samr21TrxSpiCloseAccess();
}

void samr21TrxSetRSTN(bool a_enable)
{
    // Pin PB15 == RSTN
    // Active Low
    if (a_enable)
    {
        PORT->Group[1].OUTCLR.reg = 1 << 15;
        return;
    }
    PORT->Group[1].OUTSET.reg = 1 << 15;
}

void samr21TrxSetSLP_TR(bool a_enable)
{
    // Pin PA20 == SLP_TR
    // Active High
    if (a_enable)
    {
        PORT->Group[0].OUTSET.reg = 1 << 20;
        return;
    }
    PORT->Group[0].OUTCLR.reg = 1 << 20;
}

uint8_t samr21TrxSpiTransceiveByteRaw(uint8_t a_data)
{
    while (!SERCOM4->SPI.INTFLAG.bit.DRE)
        ;
    // Put data into the tranmitt buffer to start transmission
    // PORT->Group[0].OUTTGL.reg= PORT_PA07;
    SERCOM4->SPI.DATA.bit.DATA = a_data;

    while (!SERCOM4->SPI.INTFLAG.bit.TXC)
        ;
    while (!SERCOM4->SPI.INTFLAG.bit.RXC)
        ;
    // PORT->Group[0].OUTTGL.reg= PORT_PA07;

    // return recived Answerto
    return SERCOM4->SPI.DATA.bit.DATA;
}

void samr21TrxSpiSendByteRawIgnoreResponse(uint8_t a_data)
{
    // Put data into the tranmitt buffer to start transmission
    SERCOM4->SPI.DATA.bit.DATA = a_data;

    // Wait for Transmit to Complete
    while (!SERCOM4->SPI.INTFLAG.bit.TXC)
        ;
}

void samr21TrxSpiTransceiveBytesRaw(uint8_t *a_inData_1D, uint8_t *a_outData_1D, uint8_t a_len)
{
    for (uint8_t i = 0; i < a_len; i++)
    {

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
        samr21delaySysTick(SAMR21_NUM_CPU_WAIT_CYCLES_BETWEEN_SPI_BYTES);
#endif

        if (!a_outData_1D)
        {
            samr21TrxSpiSendByteRawIgnoreResponse(a_inData_1D[i]);
            continue;
        }

        a_outData_1D[i] = samr21TrxSpiTransceiveByteRaw(a_inData_1D != NULL ? a_inData_1D[i] : SPI_DUMMY_BYTE);
    }
}

uint8_t samr21TrxSpiReadByteRaw()
{
    return samr21TrxSpiTransceiveByteRaw(SPI_DUMMY_BYTE);
}

/****************STATE CHANGES************************/
static const uint8_t sc_validRxTrxStates[] =
    {
        TRX_STATUS_BUSY_RX,
        TRX_STATUS_RX_ON};

static const uint8_t sc_validTxTrxStates[] =
    {
        TRX_STATUS_PLL_ON,
        TRX_STATUS_BUSY_TX};

static const uint8_t sc_validIdleTrxStates[] =
    {
        TRX_STATUS_TRX_OFF,
        TRX_STATUS_SLEEP,
        TRX_STATUS_P_ON};

static void samr21TrxChangeStateBlocking(uint8_t a_cmd, uint8_t *a_desiredStates, uint8_t a_numDesiredStates)
{
    samr21TrxWriteRegister(TRX_STATE_REG_ADDR, a_cmd);

    while (true)
    {
        uint8_t currentState = samr21TrxReadRegister(TRX_STATUS_REG_ADDR);

        for (uint8_t i = 0; i < a_numDesiredStates; i++)
        {
            if ((currentState & 0b00011111) == a_desiredStates[i])
            {
                return;
            }
        }
    }
}

void samr21TrxQueueMoveToRx(bool a_blocking)
{
    if (!a_blocking)
    {
        samr21TrxWriteRegister(TRX_STATE_REG_ADDR, TRX_CMD_RX_ON);
        return;
    }

    samr21TrxChangeStateBlocking(TRX_CMD_RX_ON, sc_validRxTrxStates, sizeof(sc_validRxTrxStates));
}

void samr21TrxQueueMoveToTx(bool a_blocking)
{
    if (!a_blocking)
    {
        samr21TrxWriteRegister(TRX_STATE_REG_ADDR, TRX_CMD_PLL_ON);
        return;
    }

    samr21TrxChangeStateBlocking(TRX_CMD_PLL_ON, sc_validTxTrxStates, sizeof(sc_validTxTrxStates));
}

void samr21TrxForceMoveToTx(bool a_blocking)
{
    if (!a_blocking)
    {
        samr21TrxWriteRegister(TRX_STATE_REG_ADDR, TRX_CMD_FORCE_PLL_ON);
        return;
    }

    samr21TrxChangeStateBlocking(TRX_CMD_FORCE_PLL_ON, sc_validTxTrxStates, sizeof(sc_validTxTrxStates));
}

void samr21TrxQueueMoveToIdle(bool a_blocking)
{
    if (!a_blocking)
    {
        samr21TrxWriteRegister(TRX_STATE_REG_ADDR, TRX_CMD_TRX_OFF);
        return;
    }

    samr21TrxChangeStateBlocking(TRX_CMD_TRX_OFF, sc_validIdleTrxStates, sizeof(sc_validIdleTrxStates));
}

void samr21TrxForceMoveToIdle(bool a_blocking)
{
    if (!a_blocking)
    {
        samr21TrxWriteRegister(TRX_STATE_REG_ADDR, TRX_CMD_FORCE_TRX_OFF);
        return;
    }

    samr21TrxChangeStateBlocking(TRX_CMD_FORCE_TRX_OFF, sc_validIdleTrxStates, sizeof(sc_validIdleTrxStates));
}

