dresden-elektronik/openthread-r21/src/HAL/samr21Trx.c
bool samr21TrxGetCcaResult()
{
    return s_ramCopyTrxRegister.trxStatus.bit.ccaStatus;
}

/*************************Channel Control*************************************/
void samr21TrxSetChannel(uint8_t a_channel)
{
#ifdef _DEBUG
    assert(a_channel >= 0x0B && a_channel <= 0x1A);
#endif
    if (a_channel == s_ramCopyTrxRegister.phyCcCca.bit.channel)
    {
        return;
    }

    s_ramCopyTrxRegister.phyCcCca.bit.channel = a_channel;

    samr21TrxWriteRegister(PHY_CC_CCA_REG_ADDR, s_ramCopyTrxRegister.phyCcCca.reg);
}

uint8_t samr21TrxGetChannel()
{
    return s_ramCopyTrxRegister.phyCcCca.bit.channel;
}

void samr21TrxStartCca()
{
    // Prepare CCA
    s_ramCopyTrxRegister.phyCcCca.bit.ccaRequest = 1;

    // Start CCA
    samr21TrxWriteRegister(PHY_CC_CCA_REG_ADDR, s_ramCopyTrxRegister.phyCcCca.reg);

    // Reset local copy of ccaRequest Bit
    s_ramCopyTrxRegister.phyCcCca.bit.ccaRequest = 0;
}

void samr21TrxStartEd()
{
    // Start ED by writing any value to PHY_ED_LEVEL_REG_ADDR
    // See samr21 datasheet: 37.5 Energy Detection (ED)
    samr21TrxWriteRegister(PHY_ED_LEVEL_REG_ADDR, 0xE7);
}

int8_t samr21TrxGetLastRssiValue()
{

    if (
        s_ramCopyTrxRegister.trxStatus.bit.trxStatus != TRX_STATUS_RX_ON && s_ramCopyTrxRegister.trxStatus.bit.trxStatus != TRX_STATUS_RX_ON)
    {
        return INT8_MAX;
    }

    return AT86RF233_RSSI_BASE_VAL_dBm + (int8_t)samr21TrxReadRegister(PHY_ED_LEVEL_REG_ADDR);
}

/*************************CCA Control*************************************/

void samr21RadioCtrlSetCCAMode(uint8_t a_newCcaMode)
{
    s_ramCopyTrxRegister.phyCcCca.bit.ccaMode = a_newCcaMode;
    samr21TrxWriteRegister(PHY_CC_CCA_REG_ADDR, s_ramCopyTrxRegister.phyCcCca.reg);
}

uint8_t samr21RadioCtrlGetCCAMode()
{
    return s_ramCopyTrxRegister.phyCcCca.bit.ccaMode;
}

void samr21RadioCtrlSetCcaThreshold(int8_t a_threshold)
{
    int8_t diff = (AT86RF233_RSSI_BASE_VAL_dBm - a_threshold);
    s_ramCopyTrxRegister.ccaThres.bit.ccaEdThres = abs(diff) >> 1; // Devide by 2

    samr21TrxWriteRegister(CCA_THRES_REG_ADDR, s_ramCopyTrxRegister.ccaThres.reg);
}

int8_t samr21RadioCtrlGetCcaThreshold()
{
    return (AT86RF233_RSSI_BASE_VAL_dBm + (s_ramCopyTrxRegister.ccaThres.bit.ccaEdThres << 1)); // Multiply by 2
}

/*************************Tx Power Control*************************************/
// TX Power
#define SIZE_AT86RF233_TX_POWER_TABLE 16
#ifdef _GCF_RELEASE_
static const float sc_txPowerTable_dBm_1D[SIZE_AT86RF233_TX_POWER_TABLE] = {11.9, 11.7, 11.6, 11.5, 11.3, 11.2, 11, 10.7, 10.4, 10.1, 9.3, 8.2, 6.4, 3.9, 0.1, -5.8};
#else
static const float sc_txPowerTable_dBm_1D[SIZE_AT86RF233_TX_POWER_TABLE] = {4, 3.7, 3.4, 3, 2.5, 2, 1, 0, -1, -2, -3, -4, -6, -8, -12, -17};
#endif

void samr21TrxSetTxPower(int8_t a_power_dbm)
{
    for (uint8_t i = 0; i < SIZE_AT86RF233_TX_POWER_TABLE; i++)
    {
        if (
            (sc_txPowerTable_dBm_1D[i] >= a_power_dbm) && (sc_txPowerTable_dBm_1D[i + 1] <= a_power_dbm))
        {
            s_ramCopyTrxRegister.phyTxPwr.bit.txPwr = i;
            goto exit;
        }
    }

    // Default
    s_ramCopyTrxRegister.phyTxPwr.bit.txPwr = 0x7;

exit:
    samr21TrxWriteRegister(PHY_TX_PWR_REG_ADDR, s_ramCopyTrxRegister.phyTxPwr.reg);
}

int8_t samr21TrxGetTxPower()
{
    return sc_txPowerTable_dBm_1D[s_ramCopyTrxRegister.phyTxPwr.bit.txPwr];
}

/***************Timer-Handler for Trx-Operational Timing***************************/
static volatile bool *s_timeoutFlag = NULL;
static volatile void (*s_currentTimerHandler_fktPtr)(void) = NULL;

static void samr21TrxTimeoutTriggered()
{
    *s_timeoutFlag = true;
    s_currentTimerHandler_fktPtr = NULL;
}

static void samr21TrxStartTimeoutTimer(uint16_t a_duration_us, bool *a_triggerFlag)
{
    s_timeoutFlag = a_triggerFlag;
    s_currentTimerHandler_fktPtr = &samr21TrxTimeoutTriggered;
    samr21Timer5Oneshot(a_duration_us);
}

static void samr21TrxStopTimeoutTimer()
{
    samr21Timer5Stop();
    s_timeoutFlag = NULL;
    s_currentTimerHandler_fktPtr = NULL;
}

static void samr21TrxQueueDelayedAction(uint16_t a_delay_us, void (*a_queuedAction_fktPtr)(void))
{
    s_currentTimerHandler_fktPtr = a_queuedAction_fktPtr;
    samr21Timer5Oneshot(a_delay_us);
}

static void samr21TrxRemoveQueuedAction()
{
    s_currentTimerHandler_fktPtr = NULL;
    samr21Timer5Stop();
}

// NVIC IRQ-Handler Function for Timer5 (TC5). Fkt-Addr is found in NVIC-IRQ-Vector-Table
void TC5_Handler()
{
    // Reset IRQ
    TC5->COUNT16.INTFLAG.bit.OVF = 1;

    if (s_currentTimerHandler_fktPtr)
    {
        // Invoke Handler
        (*s_currentTimerHandler_fktPtr)();
    }
}

/***************True Random Engine***************************/
uint8_t samr21TrxGetRandomCrumb()
{
    return (samr21TrxReadRegister(PHY_RSSI_REG_ADDR) >> 5) & 0b00000011;
}
uint8_t samr21TrxGetRandomNibble()
{
    return ((samr21TrxReadRegister(PHY_RSSI_REG_ADDR) >> 5) & 0b00000011) | ((samr21TrxReadRegister(PHY_RSSI_REG_ADDR) >> 3) & 0b00001100);
}
uint8_t samr21TrxGetRandomByte()
{
    uint8_t rVal = (samr21TrxReadRegister(PHY_RSSI_REG_ADDR) & 0x60) >> 5;
    rVal |= (samr21TrxReadRegister(PHY_RSSI_REG_ADDR) & 0x60) >> 3;
    rVal |= (samr21TrxReadRegister(PHY_RSSI_REG_ADDR) & 0x60) >> 1;
    rVal |= (samr21TrxReadRegister(PHY_RSSI_REG_ADDR) & 0x60) << 1;
    return rVal;
}

/*********************AES Engine*******************************/
static s_aesBusy = false;

void samr21TrxAesKeySetup(uint8_t *a_key_1D)
{
    while (s_aesBusy)
        ;

    PORT->Group[0].OUTSET.reg = PORT_PA07;
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, AES_CTRL_SRAM_ADDR);

    ramCopyTrxAesCtrl_t temp_aesCtrl = {
        .bit.dir = 0,
        .bit.mode = AT86RF233_AES_MODE_KEY,
        .bit.request = 0};
    samr21TrxSpiTransceiveByteRaw(temp_aesCtrl.reg);
    samr21TrxSpiTransceiveBytesRaw(a_key_1D, NULL, IEEE_15_4_AES_CCM_BLOCK_SIZE);
    samr21TrxSpiCloseAccess();
    PORT->Group[0].OUTCLR.reg = PORT_PA07;
}

static void samr21TrxAesEcbEncrypt(uint8_t *inDataBlock_1D, uint8_t *outDataBlock_1D)
{
    PORT->Group[0].OUTSET.reg = PORT_PA07;
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, AES_CTRL_SRAM_ADDR);

    ramCopyTrxAesCtrl_t aesCtrl =
    {
        .bit.dir = 0,
        .bit.mode = AT86RF233_AES_MODE_ECB,
        .bit.request = 0
    };

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(SAMR21_NUM_CPU_WAIT_CYCLES_BETWEEN_SPI_BYTES_FAST_ACCESS);
#endif
    samr21TrxSpiTransceiveByteRaw(aesCtrl.reg);

    for (uint8_t i = 0; i < IEEE_15_4_AES_CCM_BLOCK_SIZE; i++)
    {
        // Send New Plaintext and Retrive last Ciphertext
#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
        samr21delaySysTick(SAMR21_NUM_CPU_WAIT_CYCLES_BETWEEN_SPI_BYTES_FAST_ACCESS);
#endif
        if (outDataBlock_1D)
        {
            if (i != 0)
            {
                outDataBlock_1D[i - 1] = samr21TrxSpiTransceiveByteRaw(inDataBlock_1D == NULL ? 0x00 : inDataBlock_1D[i]);
            }
            else
            {
                samr21TrxSpiTransceiveByteRaw(inDataBlock_1D == NULL ? 0x00 : inDataBlock_1D[i]);
            }
        }
        else
        {
            samr21TrxSpiTransceiveByteRaw(inDataBlock_1D == NULL ? 0x00 : inDataBlock_1D[i]);
        }
    }

    aesCtrl.bit.request = 1;

    if (outDataBlock_1D)
    {
        outDataBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE - 1] = samr21TrxSpiTransceiveByteRaw(aesCtrl.reg);
    }
    else
    {
        samr21TrxSpiTransceiveByteRaw(aesCtrl.reg);
    }

    samr21TrxSpiCloseAccess();
    PORT->Group[0].OUTCLR.reg = PORT_PA07;
}

