dresden-elektronik/openthread-r21/src/HAL/samr21Trx.c
static void samr21TrxAesCbcEncrypt(uint8_t *inDataBlock_1D, uint8_t *outDataBlock_1D)
{
    PORT->Group[0].OUTSET.reg = PORT_PA07;
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, AES_CTRL_SRAM_ADDR);

    // Send ECB encription Command
    ramCopyTrxAesCtrl_t aesCtrl = {
        .bit.dir = 0,
        .bit.mode = AT86RF233_AES_MODE_CBC,
        .bit.request = 0};

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    samr21TrxSpiTransceiveByteRaw(aesCtrl.reg);

    for (uint8_t i = 0; i < IEEE_15_4_AES_CCM_BLOCK_SIZE; i++)
    {
        // Send New Plaintext and Retrive last Ciphertext
#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
        samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES_FAST_ACCESS);
#endif
        if (outDataBlock_1D)
        {
            if (i != 0)
            {
                outDataBlock_1D[i - 1] = samr21TrxSpiTransceiveByteRaw(inDataBlock_1D == NULL ? 0x00 : inDataBlock_1D[i]);
            }
            else
            {
                samr21TrxSpiTransceiveByteRaw(inDataBlock_1D == NULL ? 0x00 : inDataBlock_1D[i]);
            }
        }
        else
        {
            samr21TrxSpiSendByteRawIgnoreResponse(inDataBlock_1D == NULL ? 0x00 : inDataBlock_1D[i]);
        }
    }

    aesCtrl.bit.request = 1;

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    if (outDataBlock_1D)
    {
        outDataBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE - 1] = samr21TrxSpiTransceiveByteRaw(aesCtrl.reg);
    }
    else
    {
        samr21TrxSpiTransceiveByteRaw(aesCtrl.reg);
    }

    samr21TrxSpiCloseAccess();
    PORT->Group[0].OUTCLR.reg = PORT_PA07;
}

/****************FRAMEBUFFER READ ACCESS************************/
bool samr21TrxLiveFramebufferDownload(uint8_t *a_data_1D, uint8_t a_len)
{

#ifdef _DEBUG
    assert(a_len <= IEEE_802_15_4_FRAME_SIZE);
    assert(a_data_1D);
#endif

    uint8_t numDownloadedBytes = 0;

    // Set a Timeout
    volatile bool abortActionFlag = false;
    samr21TrxStartTimeoutTimer((((uint16_t)(a_len)*2) * IEEE_15_4_24GHZ_TIME_PER_OCTET_us), &abortActionFlag);

    samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_READ, NULL);

    a_data_1D[numDownloadedBytes++] = samr21TrxSpiReadByteRaw();

    while (numDownloadedBytes < a_len)
    {
        //(see r21 datasheet, 40.7 Frame Buffer Empty Indicator)
        samr21delaySysTick(SAMR21_NUM_CPU_WAIT_CYCLES_FOR_FRAME_BUFFER_EMPTY_FLAG);
        while ((PORT->Group[1].IN.reg & PORT_PB00) && !abortActionFlag)
            ;

        // Abort if a Timeout happened
        if (abortActionFlag)
        {
            goto exit;
        }

        a_data_1D[numDownloadedBytes++] = samr21TrxSpiReadByteRaw();
    }
    samr21TrxStopTimeoutTimer();

exit:
    samr21TrxSpiCloseAccess();
    return !abortActionFlag;
}

bool samr21TrxDownloadFramebuffer(uint8_t *a_psduLen, uint8_t *a_psdu_1D, uint8_t *a_LQI_p, int8_t *a_RSSI_p, bool a_live)
{

#ifdef _DEBUG
    assert(a_psduLen);
    assert(a_psdu_1D);
    assert(a_LQI);
    assert(a_RSSI);
#endif

    uint8_t numDownloadedBytes = 0;
    bool validFrame = true;

    samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_READ, NULL);

    // First Byte Downloaded is the psduLen
    *a_psduLen = samr21TrxSpiReadByteRaw();

    // Check if the Framelenght is within limits outlined by 802.15.4
    if (*a_psduLen > IEEE_15_4_PDSU_SIZE)
    {
        validFrame = false;
        goto exit;
    }

    // Set a Timeout
    volatile bool abortActionFlag = false;
    samr21TrxStartTimeoutTimer((IEEE_15_4_FRAME_SIZE * IEEE_15_4_24GHZ_TIME_PER_OCTET_us), &abortActionFlag); // Shift for cheap multiply x2

    while (numDownloadedBytes < *a_psduLen)
    {
        //(see r21 datasheet, 40.7 Frame Buffer Empty Indicator)
        samr21delaySysTick(SAMR21_NUM_CPU_WAIT_CYCLES_FOR_FRAME_BUFFER_EMPTY_FLAG);

        if(a_live)
        {
             while ((PORT->Group[1].IN.reg & PORT_PB00) && !abortActionFlag)
            ;
        }


        if (abortActionFlag)
        {
            validFrame = false;
            goto exit;
        }

        a_psdu_1D[(numDownloadedBytes++)] = samr21TrxSpiReadByteRaw();
    }
    samr21TrxStopTimeoutTimer();

    // Download LQI, RSSI and CRC Check (r21 Datasheet 35.3.2 -  Frame Buffer Access Mode)
    *a_LQI_p = samr21TrxSpiReadByteRaw();
    *a_RSSI_p = AT86RF233_RSSI_BASE_VAL_dBm + samr21TrxSpiReadByteRaw();

    // Check if CRC is correct (samr21 Datasheet 35.3.2 Frame Buffer Access Mode - Structure of RX_STATUS)
    validFrame &= samr21TrxSpiReadByteRaw() >> 7;

exit:
    samr21TrxSpiCloseAccess();
    return validFrame;
}

/****************FRAMEBUFFER WRITE ACCESS************************/
void samr21TrxUploadToFramebuffer(uint8_t *a_data_1D, uint8_t a_len, uint8_t a_pos)
{

#ifdef _DEBUG
    assert(a_len <= IEEE_802_15_4_FRAME_SIZE);
    assert((a_pos + a_len) <= IEEE_802_15_4_FRAME_SIZE);
    assert(a_data_1D);
#endif

    PORT->Group[0].OUTSET.reg = PORT_PA06;
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, a_pos);
    samr21TrxSpiTransceiveBytesRaw(a_data_1D, NULL, a_len); // phyLen not in psduLen
    samr21TrxSpiCloseAccess();
    PORT->Group[0].OUTCLR.reg = PORT_PA06;
}



//IRQ ISR from DMAC
void DMAC_Handler()
{
    samr21Timer3Stop();
    samr21TrxSpiCloseAccess();

    DMAC->CHID.reg = 0x00; 
    DMAC->CHCTRLA.bit.ENABLE=0;

    s_trxVars.txDmacDescriptor.BTCTRL.bit.VALID =  0;

    s_trxVars.dmaActive = false;    
    PORT->Group[0].OUTCLR.reg = PORT_PA06;
}

void samr21TrxUploadToFramebufferViaDma(uint8_t *a_data_1D, uint8_t a_len, uint8_t a_pos)
{
#ifdef _DEBUG
    assert(a_len <= IEEE_802_15_4_FRAME_SIZE);
    assert((a_pos + a_len) <= IEEE_802_15_4_FRAME_SIZE);
    assert(a_data_1D);
#endif

    s_trxVars.txDmacDescriptor.BTCNT.bit.BTCNT = a_len;
    s_trxVars.txDmacDescriptor.SRCADDR.bit.SRCADDR= a_data_1D;
    s_trxVars.txDmacDescriptor.BTCTRL.bit.VALID =  1;



    PORT->Group[0].OUTSET.reg = PORT_PA06;
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, a_pos);

    DMAC->CHID.reg = 0x00; 
    DMAC->CHCTRLA.bit.ENABLE=1;


    samr21Timer3SetContinuousPeriod(32); //   8Bit / 250Kbits --> 32us per Byte
    s_trxVars.dmaActive = true;

   while (s_trxVars.dmaActive);
}

/*********FRAMEBUFFER WRITE ACCESS (with Security)**************/
static struct trxSecurity_s
{
    uint8_t securityLevel;

    uint8_t numBytesUploaded;

    uint8_t numEncryptionBlocksDone;
    uint8_t numAuthenticationPayloadBlocksDone;

    union
    {
        uint8_t numAuthenticationPayloadBlocksNeeded;
        uint8_t numEncryptionBlocksNeeded;
    };

    uint8_t numAuthenticationHeaderBlocksDone;
    uint8_t numAuthenticationHeaderBlocksNeeded;

