dresden-elektronik/openthread-r21/src/HAL/samr21Trx.c
    uint8_t currentSizeCbcBlock;

    uint8_t *header_p;
    uint8_t headerLen;
    uint8_t *payload_p;
    uint8_t payloadLen;
    uint8_t *footer_p;
    uint8_t micSize; // Footer also includes the FCS but this is automatically calculated by TRX (samr21 datasheet 37.3.3 Automatic FCS Generation)

    union
    {
        uint8_t aesCbcBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE];
        uint8_t aesCtrBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE];
        uint8_t micBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE];
    };

    uint8_t encryptionMask_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE];

} s_trxSecurity;

static void samr21TrxUploadEncryptedToFramebuffer(uint8_t *a_data_1D, uint8_t *a_xorMask_1D, uint8_t a_len, uint8_t a_pos)
{

#ifdef _DEBUG
    assert(a_len <= IEEE_15_4_AES_CCM_BLOCK_SIZE);
    assert((a_pos + a_len) <= IEEE_15_4_FRAME_SIZE);
    assert(a_data_1D);
    assert(a_xorMask_1D);
#endif

    PORT->Group[0].OUTSET.reg = PORT_PA06;
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, a_pos);

    for (uint8_t i = 0; i < a_len; i++)
    {
        samr21TrxSpiTransceiveByteRaw(a_data_1D[i] ^ a_xorMask_1D[i]);
    }

    samr21TrxSpiCloseAccess();
    PORT->Group[0].OUTCLR.reg = PORT_PA06;
}

static void samr21TrxAuthenticateFinish()
{
    // Start a DummyRound to retrieve the result of the last Round
    // TODO remove Dummy round!
    samr21TrxAesCbcEncrypt(NULL, s_trxSecurity.micBlock_1D);

    // Last AES Action took place, the engine can be unlocked again
    s_aesBusy = false;

    if (s_trxSecurity.micSize)
    {
        samr21TrxUploadEncryptedToFramebuffer(
            s_trxSecurity.micBlock_1D,
            s_trxSecurity.encryptionMask_1D,
            s_trxSecurity.micSize,
            s_trxSecurity.numBytesUploaded);
        s_trxSecurity.numBytesUploaded += s_trxSecurity.micSize;
    }

    // FCS is done by TRX (samr21 datasheet 37.3.3 Automatic FCS Generation)

#ifdef _DEBUG
    assert(s_trxSecurity.numBytesUploaded == (s_trxSecurity.headerLen + s_trxSecurity.payloadLen + s_trxSecurity.micSize + 1)) // psduLen not part of headerLength
#endif
}

static void samr21TrxAuthenticateLoop()
{

    // Start the AES Engine
    if (s_trxSecurity.numAuthenticationHeaderBlocksDone < s_trxSecurity.numAuthenticationHeaderBlocksNeeded)
    {
        // start the next CBC-Round for a header Block
        samr21TrxAesCbcEncrypt(s_trxSecurity.aesCbcBlock_1D, NULL); // only the last round CBC output is relevant
        // memcpy(AESCBCINPUT[AEStemp++],s_trxSecurity.aesCbcBlock_1D,IEEE_15_4_AES_CCM_BLOCK_SIZE);

        s_trxSecurity.numAuthenticationHeaderBlocksDone++;
    }
    else if (s_trxSecurity.numAuthenticationPayloadBlocksDone < s_trxSecurity.numAuthenticationPayloadBlocksNeeded)
    {
        // start the next CBC-Round for a Payload
        samr21TrxAesCbcEncrypt(s_trxSecurity.aesCbcBlock_1D, NULL); // only the last round CBC output is relevant
        // memcpy(AESCBCINPUT[AEStemp++],s_trxSecurity.aesCbcBlock_1D,IEEE_15_4_AES_CCM_BLOCK_SIZE);

        s_trxSecurity.numAuthenticationPayloadBlocksDone++;
    }

    if (s_trxSecurity.numAuthenticationPayloadBlocksDone == s_trxSecurity.numAuthenticationPayloadBlocksNeeded && s_trxSecurity.numAuthenticationHeaderBlocksDone == s_trxSecurity.numAuthenticationHeaderBlocksNeeded)
    {
        // Start a Timer for when the AES-Engine is done
        samr21TrxQueueDelayedAction(AT86RF233_ADJUSTED_AES_BUSY_TIME_us, samr21TrxAuthenticateFinish);
        return;
    }

    // Start a Timer for when the AES-Engine is done
    samr21TrxQueueDelayedAction(AT86RF233_ADJUSTED_AES_BUSY_TIME_us, samr21TrxAuthenticateLoop);

    // Prepare Memory for next Action when AES-Engine is done/ready
    if (s_trxSecurity.numAuthenticationHeaderBlocksDone < s_trxSecurity.numAuthenticationHeaderBlocksNeeded)
    {

        // Calculate current Header Offset
        uint8_t headerOffset = (IEEE_15_4_AES_CCM_BLOCK_SIZE * s_trxSecurity.numAuthenticationHeaderBlocksDone) - 2; // 2Bytes HeaderLen in first CBC Round

        // Fill a new Header Block
        for (uint8_t i = 0; i < IEEE_15_4_AES_CCM_BLOCK_SIZE; i++)
        {
            if ((headerOffset + i) < s_trxSecurity.headerLen)
            {
                s_trxSecurity.aesCbcBlock_1D[i] = s_trxSecurity.header_p[headerOffset + i];
                continue;
            }

            s_trxSecurity.aesCbcBlock_1D[i] = 0x00; // Fill up rest with 0
        }
    }
    else if (s_trxSecurity.numAuthenticationPayloadBlocksDone < s_trxSecurity.numAuthenticationPayloadBlocksNeeded)
    {

        // Calculate current Payload Offset
        uint8_t payloadOffset = (IEEE_15_4_AES_CCM_BLOCK_SIZE * s_trxSecurity.numAuthenticationPayloadBlocksDone);

        // Fill a new Header Block
        for (uint8_t i = 0; i < IEEE_15_4_AES_CCM_BLOCK_SIZE; i++)
        {
            if ((payloadOffset + i) < s_trxSecurity.payloadLen)
            {
                s_trxSecurity.aesCbcBlock_1D[i] = s_trxSecurity.payload_p[payloadOffset + i];
                continue;
            }

            s_trxSecurity.aesCbcBlock_1D[i] = 0x00; // Fill up rest with 0
        }
    }
}

static void samr21TrxAuthenticateStart()
{
    // Form init Vector (See IEEE 802.15.4-2015 Appendix B for good examples)
    // Nonce is already in CBC block because of union within the s_trxSecurity struct
    s_trxSecurity.aesCbcBlock_1D[0] =
        (s_trxSecurity.headerLen != 0 ? 0b01000000 : 0x0) | (((s_trxSecurity.micSize - 2) >> 1) << 3) | 1; // L always 2
    s_trxSecurity.aesCbcBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE - 2] = 0;                                    // always 0 cause maxlenght is 127
    s_trxSecurity.aesCbcBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE - 1] = s_trxSecurity.payloadLen;

    // start the first CBC-Round with init vector (plain ECB, r21 datasheet 40.1.4.2 Cipher Block Chaining (CBC))
    // simultaneously retrieve the MIC encryptionBlock from the CTR-Section
    samr21TrxAesEcbEncrypt(s_trxSecurity.aesCbcBlock_1D, s_trxSecurity.encryptionMask_1D);

    // Fill first CBC Block to be authenticated
    // First 2 Bytes are U16 representation of Header length
    s_trxSecurity.aesCbcBlock_1D[0] = s_trxSecurity.headerLen >> 8;
    s_trxSecurity.aesCbcBlock_1D[1] = s_trxSecurity.headerLen >> 0;

    // Catch the Case of a really small header Size
    if (s_trxSecurity.headerLen <= (IEEE_15_4_AES_CCM_BLOCK_SIZE - 2))
    {
        memcpy(&s_trxSecurity.aesCbcBlock_1D[2], s_trxSecurity.header_p, s_trxSecurity.headerLen);
        memset(&s_trxSecurity.aesCbcBlock_1D[2], 0, IEEE_15_4_AES_CCM_BLOCK_SIZE - 2 - s_trxSecurity.headerLen);
    }
    else
    {
        memcpy(&s_trxSecurity.aesCbcBlock_1D[2], s_trxSecurity.header_p, (IEEE_15_4_AES_CCM_BLOCK_SIZE - 2));
    }

