dresden-elektronik/openthread-r21/src/HAL/samr21Trx.c
    // Prep rest of the Memory for the next Actions
    s_trxSecurity.numAuthenticationHeaderBlocksDone = 0;
    s_trxSecurity.numAuthenticationHeaderBlocksNeeded = (s_trxSecurity.headerLen + 2) / IEEE_15_4_AES_CCM_BLOCK_SIZE; // First Header Block starts with headerLen
    if ((s_trxSecurity.headerLen + 2) % IEEE_15_4_AES_CCM_BLOCK_SIZE)
    {
        s_trxSecurity.numAuthenticationHeaderBlocksNeeded++;
    }

    s_trxSecurity.currentSizeCbcBlock = IEEE_15_4_AES_CCM_BLOCK_SIZE;
    s_trxSecurity.numAuthenticationPayloadBlocksDone = 0;

    // numAuthenticationPayloadBlocksNeeded is already calculated because of union with EncryptionBlockNeeded

    // Start a Timer for when the AES-Engine is done
    samr21TrxQueueDelayedAction(AT86RF233_ADJUSTED_AES_BUSY_TIME_us, samr21TrxAuthenticateLoop);
}

static void samr21TrxEncryptAndUploadPayload()
{
    while (s_trxSecurity.numEncryptionBlocksDone < s_trxSecurity.numEncryptionBlocksNeeded)
    {
        if ((s_trxSecurity.numEncryptionBlocksDone + 1) < s_trxSecurity.numEncryptionBlocksNeeded)
        {
            // increase Nonce Counter for next AES-CTR-Block
            s_trxSecurity.aesCtrBlock_1D[(IEEE_15_4_AES_CCM_BLOCK_SIZE - 1)]++;
            // start uploading next AES-CTR Block, while simultaneously retrieving (SPI SRAM-Fast-Access) the result of the last AES-CTR-Round
            samr21TrxAesEcbEncrypt(s_trxSecurity.aesCtrBlock_1D, s_trxSecurity.encryptionMask_1D);
            // Write via SRAM starting from Addr of the current Byte to the Framebuffer
            samr21TrxUploadEncryptedToFramebuffer(
                (s_trxSecurity.payload_p + (IEEE_15_4_AES_CCM_BLOCK_SIZE * s_trxSecurity.numEncryptionBlocksDone)),
                s_trxSecurity.encryptionMask_1D,
                IEEE_15_4_AES_CCM_BLOCK_SIZE,
                s_trxSecurity.numBytesUploaded);
            s_trxSecurity.numBytesUploaded += IEEE_15_4_AES_CCM_BLOCK_SIZE;
        }
        else
        {

            uint8_t lastEncryptedPayloadBlockSize = ((s_trxSecurity.payloadLen % IEEE_15_4_AES_CCM_BLOCK_SIZE) ? (s_trxSecurity.payloadLen % IEEE_15_4_AES_CCM_BLOCK_SIZE) : IEEE_15_4_AES_CCM_BLOCK_SIZE);

            // set Nonce Counter to 0 for later encryption of MIC
            s_trxSecurity.aesCtrBlock_1D[(IEEE_15_4_AES_CCM_BLOCK_SIZE - 1)] = 0;
            // start encrypting the AES-CTR Block for MIC encryption, while simultaneously retrieving (SPI SRAM-Fast-Access) the result of the final Payload AES-CTR-Round
            samr21TrxAesEcbEncrypt(s_trxSecurity.aesCtrBlock_1D, s_trxSecurity.encryptionMask_1D);
            // Write via SRAM starting from Addr of the current Byte to the Framebuffer
            samr21TrxUploadEncryptedToFramebuffer(
                (s_trxSecurity.payload_p + (IEEE_15_4_AES_CCM_BLOCK_SIZE * s_trxSecurity.numEncryptionBlocksDone)),
                s_trxSecurity.encryptionMask_1D,
                lastEncryptedPayloadBlockSize,
                s_trxSecurity.numBytesUploaded);

            s_trxSecurity.numBytesUploaded += lastEncryptedPayloadBlockSize;
        }

        s_trxSecurity.numEncryptionBlocksDone++;
    }

    // Delay is needed here cause if the last PayloadBlock is pretty short
    // There could be a Edge Case where the time it take to upload this last Block
    // Is shorter then the AES Cycle Time
    if (s_trxSecurity.micSize)
    {
        samr21TrxAuthenticateStart();
    }
}

void samr21TrxSendFrameAndApplyMacSecurity(uint8_t *a_header_p, uint8_t *a_payload_p, uint8_t *a_footer_p, uint8_t a_secLevel, uint8_t *a_key_1D, uint8_t *a_nonce_1D)
{

#ifdef _DEBUG
    assert(a_secLevel >= 0b100);
#endif

    // Block AES Engine, so no Key Change takes places while frame is being transmitted
    s_aesBusy = true;

    // Upload the unecrypted Part of the Message first. This is done o the Framebuffer doesn't get empty, while AES-CCM* is ongoing
    // Frame Transmission and AES-CCM* is done in Parallel
    s_trxSecurity.headerLen = (uint8_t)(a_payload_p - a_header_p);
    samr21TrxUploadToFramebuffer(a_header_p, s_trxSecurity.headerLen, 0);

    // Start Transmission
    samr21TrxSetSLP_TR(true);

    // Prep CTR Block (input for AES-Engine, Output get XORed with payload)
    s_trxSecurity.aesCtrBlock_1D[0] = 1; // Always 1 cause L is always 2
    memcpy(&s_trxSecurity.aesCtrBlock_1D[1], a_nonce_1D, IEEE_15_4_AES_CCM_NONCE_SIZE);
    s_trxSecurity.aesCtrBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE - 2] = 0; // Always 0 cause ctr-Value never exceeds 0xFF
    s_trxSecurity.aesCtrBlock_1D[IEEE_15_4_AES_CCM_BLOCK_SIZE - 1] = 1; // Start with ctr = 1, because timing for payload encryption is crucial

    // Start Encryption of first CTR Block
    samr21TrxAesEcbEncrypt(s_trxSecurity.aesCtrBlock_1D, NULL);
    // Start Timer for when result AES-Engine is done
    samr21TrxQueueDelayedAction(AT86RF233_ADJUSTED_AES_BUSY_TIME_us, samr21TrxEncryptAndUploadPayload);

    // Prep part of the Memory for the next Actions
    s_trxSecurity.numBytesUploaded = s_trxSecurity.headerLen;
    s_trxSecurity.securityLevel = a_secLevel;

    // Copy Frame inicies pointer
    s_trxSecurity.payload_p = a_payload_p;
    s_trxSecurity.footer_p = a_footer_p;

    // Remove psdu-Framelenght octet form header. Only mac-frame content is of intrest for AES
    s_trxSecurity.headerLen--;
    s_trxSecurity.header_p = a_header_p + 1;

    s_trxSecurity.payloadLen = (uint8_t)(a_footer_p - a_payload_p);

    s_trxSecurity.numEncryptionBlocksDone = 0;
    s_trxSecurity.numEncryptionBlocksNeeded = s_trxSecurity.payloadLen / IEEE_15_4_AES_CCM_BLOCK_SIZE;
    if (s_trxSecurity.payloadLen % IEEE_15_4_AES_CCM_BLOCK_SIZE)
    {
        s_trxSecurity.numEncryptionBlocksNeeded++;
    }

    switch (s_trxSecurity.securityLevel & 0b11)
    {
    case 0b00:
        s_trxSecurity.micSize = 0;
        break;

    case 0b01:
        s_trxSecurity.micSize = 4;
        break;

    case 0b10:
        s_trxSecurity.micSize = 8;
        break;

    case 0b11:
        s_trxSecurity.micSize = 16;
        break;
    }

    // Transmission Should have started by now
    samr21TrxSetSLP_TR(false);
}

/**********TRX EVENT HANDLER********/

// External IRQs form TRX
static void (*s_currentIsrHandler_fktPtr[NUM_TRX_IRQS])(void) = {NULL};

void samr21TrxSetIrqHandler(uint8_t a_irqType, void (*a_handler_fktPtr)(void))
{

#ifdef _DEBUG
    assert(a_irqType <= (NUM_TRX_IRQS - 1));
#endif

    s_currentIsrHandler_fktPtr[a_irqType] = a_handler_fktPtr;
}

void samr21TrxRemoveAllHandler()
{
    for (uint8_t i = 0; i < NUM_TRX_IRQS; i++)
    {
        s_currentIsrHandler_fktPtr[i] = NULL;
    }
}

