dresden-elektronik/openthread-r21/src/HAL/samr21Trx.c
void samr21TrxDisableAllIrq()
{
    s_ramCopyTrxRegister.irqMask.reg = 0x00;

    samr21TrxWriteRegister(IRQ_MASK_REG_ADDR, s_ramCopyTrxRegister.irqMask.reg);
}

void samr21TrxEnableIrq(uint8_t a_irqType)
{

#ifdef _DEBUG
    assert(a_irqType <= (NUM_TRX_IRQS - 1));
#endif

    uint8_t shiftedIrqEnableBit = 1 << a_irqType;

    if (shiftedIrqEnableBit & s_ramCopyTrxRegister.irqMask.reg)
    {
        // Already enabled
        return;
    }

    s_ramCopyTrxRegister.irqMask.reg |= shiftedIrqEnableBit;

    samr21TrxWriteRegister(IRQ_MASK_REG_ADDR, s_ramCopyTrxRegister.irqMask.reg);
}

void samr21TrxDisableIrq(uint8_t a_irqType)
{

#ifdef _DEBUG
    assert(a_irqType <= (NUM_TRX_IRQS - 1));
#endif

    uint8_t shiftedIrqDisableBit = 1 << a_irqType;

    if (shiftedIrqDisableBit & ~s_ramCopyTrxRegister.irqMask.reg)
    {
        // Already disabled
        return;
    }

    s_ramCopyTrxRegister.irqMask.reg &= ~shiftedIrqDisableBit;

    samr21TrxWriteRegister(IRQ_MASK_REG_ADDR, s_ramCopyTrxRegister.irqMask.reg);
}

void EIC_Handler()
{
    // Clear IRQ
    EIC->INTFLAG.bit.EXTINT0 = 1;

    s_ramCopyTrxRegister.irqStatus.reg = samr21TrxReadRegister(IRQ_STATUS_REG_ADDR);

    if (s_ramCopyTrxRegister.irqStatus.bit.rxStart && (s_currentIsrHandler_fktPtr[TRX_IRQ_RX_START] != NULL))
    {
        (*s_currentIsrHandler_fktPtr[TRX_IRQ_RX_START])();
    }

    if (s_ramCopyTrxRegister.irqStatus.bit.trxEnd && (s_currentIsrHandler_fktPtr[TRX_IRQ_TRX_END] != NULL))
    {
        (*s_currentIsrHandler_fktPtr[TRX_IRQ_TRX_END])();
    }

    if (s_ramCopyTrxRegister.irqStatus.bit.pllLock && (s_currentIsrHandler_fktPtr[TRX_IRQ_PLL_LOCK] != NULL))
    {
        (*s_currentIsrHandler_fktPtr[TRX_IRQ_TRX_END])();
    }

    if (s_ramCopyTrxRegister.irqStatus.bit.pllUnlock && (s_currentIsrHandler_fktPtr[TRX_IRQ_PLL_UNLOCK] != NULL))
    {
        (*s_currentIsrHandler_fktPtr[TRX_IRQ_PLL_UNLOCK])();
    }

    if (s_ramCopyTrxRegister.irqStatus.bit.ccaEdDone && (s_currentIsrHandler_fktPtr[TRX_IRQ_CCA_ED_DONE] != NULL))
    {
        (*s_currentIsrHandler_fktPtr[TRX_IRQ_CCA_ED_DONE])();
    }

    if (s_ramCopyTrxRegister.irqStatus.bit.addressMatch && (s_currentIsrHandler_fktPtr[TRX_IRQ_AMI] != NULL))
    {
        (*s_currentIsrHandler_fktPtr[TRX_IRQ_AMI])();
    }

    if (s_ramCopyTrxRegister.irqStatus.bit.bufferUnderRun && (s_currentIsrHandler_fktPtr[TRX_IRQ_TRX_UR] != NULL))
    {
        (*s_currentIsrHandler_fktPtr[TRX_IRQ_TRX_UR])();
    }

    if (s_ramCopyTrxRegister.irqStatus.bit.batteryLow && (s_currentIsrHandler_fktPtr[TRX_IRQ_BAT_LOW] != NULL))
    {
        (*s_currentIsrHandler_fktPtr[TRX_IRQ_BAT_LOW])();
    }
}